[metadata]
creation_date = "2023/02/01"

[rule]
author = ["Jarrett Sams"]
description = "This rule looks for.zip files being created in a path containing Windows/Temp."
from = "now-6m" # look-back time: 6 minutes. Change as needed.
name = "Data Archived for Potential Exfiltration"
risk_score = 69
severity = "medium"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000002"
query = '''
event.dataset: "endpoint.events.file" and event.action: (creation or overwrite) and process.name: "powershell.exe" and file.path: *Windows\\\\Temp\\\\* and file.name: *.zip
'''

# if type is "threshold" instead, uncomment and modify below:
# [rule.threshold]
# field = ["host.hostname"]
# value = 100

[[rule.threat]] # Example Tactic, Technique, Sub-Technique. Change as needed.
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1074"
name = "Data Staged"
reference = "https://attack.mitre.org/techniques/T1074/"

[[rule.threat.technique.subtechnique]]
id = "T1074.001"
name = "Local Data Staging"
reference = "https://attack.mitre.org/techniques/T1074/001/"

[rule.threat.tactic]
id = "TA0009"
name = "Collection"
reference = "https://attack.mitre.org/tactics/TA0009/"



# Optional Fields:
# throttle: 7d
# version: 1
# interval: 5m