[metadata]
creation_date = "2023/09/01"

[rule]
author = ["Jarrett Sams"]
description = "This alert is triggered by sysmon_operational logs that contains default Metasploit/MSFvenom Powershell reverse shell code/string."
from = "now-6m" # look-back time: 6 minutes. Change as needed.
name = "Potential Metasploit/MSFvenom Payload Observed"
risk_score = 100
severity = "critical"
type = "query"
rule_id = "00000000-0000-0000-0000-000000000005"
query = '''
event.dataset: "windows.sysmon_operational" and process.command_line: *cmd.exe* and message: "*powershell -w hidden -nop -c $a='*"
'''

# if type is "threshold" instead, uncomment and modify below:
# [rule.threshold]
# field = ["host.hostname"]
# value = 100

[[rule.threat]] # Example Tactic, Technique, Sub-Technique. Change as needed.
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[[rule.threat.technique.subtechnique]]
id = "T1059.001"
name = "PowerShell"
reference = "https://attack.mitre.org/techniques/T1059/001/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"


# Optional Fields:
# throttle: 7d
# version: 1
# interval: 5m